Repository: chrischen/racquetleague-ui
Catalog: src/locales/*.po
Languages: ja, th

source: End Date
th: วันที่สิ้นสุด

source: Start Date
th: วันที่เริ่มต้น

source: Title
th: หัวข้อ

source: (Logout)
th: (ออกจากระบบ)

source: {0} {breakPlayersDesc} are not playing
ja: {0} {breakPlayersDesc} はプレイしていません
th: {0} {breakPlayersDesc} ไม่ได้เล่น

source: {0} player selected
ja: {0}人のプレイヤーが選択されました
th: เลือกผู้เล่น {0} คน

source: {0} players selected
ja: {0}人のプレイヤーが選択されました
th: เลือกผู้เล่น {0} คน

source: {breakPlayersCount, plural, one {player} other {players}}
ja: {breakPlayersCount, plural, one {プレイヤー} other {プレイヤー}}
th: ผู้เล่น

source: # of courts
ja: コート数
th: จำนวนคอร์ต

source: Actions
ja: アクション
th: การกระทำ

source: Add Guest
ja: ゲストを追加
th: เพิ่มแขก

source: Add Guest Player
ja: ゲストプレイヤーを追加
th: เพิ่มผู้เล่นแขก

source: Add Player
ja: プレイヤーを追加
th: เพิ่มผู้เล่น

source: Add/Remove Players
th: เพิ่ม/ลบผู้เล่น

source: Advanced Options
ja: 詳細オプション
th: ตัวเลือกขั้นสูง

source: Analyzed {0} matches.
ja: {0}試合を分析しました。
th: วิเคราะห์แมทช์แล้ว {0} แมทช์

source: and
ja: と
th: และ

source: cancel
ja: キャンセル
th: ยกเลิก

source: Cancel
ja: キャンセル
th: ยกเลิก

source: Checkin All Players
ja: すべてのプレイヤーをチェックイン
th: เช็คอินผู้เล่นทั้งหมด

source: Choose Match
ja: 試合を選択
th: เลือกแมทช์

source: CHOOSE MATCH
ja: 試合を選択
th: เลือกแมทช์

source: Clear Session (Ratings, Match Counts, and Guest Players)
ja: セッションをクリア（評価、試合数、ゲストプレイヤー）
th: ล้างเซสชั่น (เรตติ้ง, จำนวนการแข่งขัน และผู้เล่นแขก)

source: Close panel
ja: パネルを閉じる
th: ปิดแผง

source: Competitive
ja: 競争力
th: แข่งขัน

source: Court {0}: {team1} versus {team2}
ja: コート {0}: {team1} 対 {team2}
th: คอร์ต {0}: {team1} เทียบ {team2}

source: Create Anti-Team
ja: アンチチームを作成
th: สร้างแอนตี้ทีม

source: Create Team
ja: チームを作成
th: สร้างทีม

source: Done
ja: 完了
th: เสร็จ

source: Enter Score
ja: スコアを入力
th: ป้อนคะแนน

source: Fixed Pair
ja: 固定ペア
th: คู่ครอง

source: Gender Mixed Doubles
ja: 男女混合ダブルス
th: คู่คล้องผสมเพศ

source: Go Back
ja: 戻る
th: กลับ

source: How many players should rest? (currently {0} players are resting)
ja: 何人のプレイヤーが休むべきですか？（現在{0}人のプレイヤーが休んでいます）
th: ผู้เล่นกี่คนควรพัก? (ปัจจุบันมีผู้เล่น {0} คนกำลังพัก)

source: Initialize Ratings
ja: 評価を初期化
th: ตั้งค่าเรตติ้งเริ่มต้น

source: Leaderboard
ja: リーダーボード
th: กระดานผู้นำ

source: left team players
ja: 左チームのプレイヤー
th: ผู้เล่นทีมซ้าย

source: Loading
ja: 読み込み中
th: กำลังโหลด

source: Loading...
ja: 読み込み中...
th: กำลังโหลด...

source: manual team
ja: 手動チーム
th: ทีมแมนนวล

source: Match History
ja: 対戦履歴
th: ประวัติแมทช์

source: Matches
ja: 試合
th: แมทช์

source: Matches are arranged by a maximum skill-spread of +- 1 players.
ja: マッチは、最大スキルスプレッドが+-1プレイヤーになるように配置されます。
th: แมทช์ถูกจัดโดยความแตกต่างของทักษะสูงสุด +- 1 คน

source: Matches are arranged by skill while mixing strong and weak players.
ja: マッチは、強いプレイヤーと弱いプレイヤーを混ぜながらスキルによって配置されます。
th: แมทช์ถูกจัดตามทักษะโดยผสมผู้เล่นเก่งและอ่อน

source: Mixed
ja: 混合
th: ผสม

source: no players yet
ja: まだプレイヤーはいません
th: ยังไม่มีผู้เล่น

source: Not enough players in the queue. Select the players who want to play from the Queue tab.
ja: キューに十分なプレイヤーがいません。キュータブからプレイしたいプレイヤーを選択してください。
th: ผู้เล่นในคิวไม่เพียงพอ เลือกผู้เล่นที่ต้องการเล่นจาก แท็บคิว

source: Offline Mode
ja: オフラインモード
th: โหมดออฟไลน์

source: Played last round
ja: 前回プレイした
th: เล่นรอบที่แล้ว

source: Player
ja: プレイヤー
th: ผู้เล่น

source: Player Name
ja: プレイヤー名
th: ชื่อผู้เล่น

source: Players in a team will always be placed in a match together on the same side.
ja: チームのプレイヤーは常に同じ側で一緒に試合に配置されます。
th: ผู้เล่นในทีมจะถูกจับคู่ในการแข่งขันด้วยกันเสมอในข้างเดียวกัน

source: Players in an anti-team will never be placed in a match together.
ja: アンチチームのプレイヤーは、試合で一緒に配置されることはありません。
th: ผู้เล่นในแอนตี้-ทีมจะไม่ถูกจับคู่ในการแข่งขันด้วยกันเลย

source: Players in teams will always be placed in a match together on the same side.
ja: チームのプレイヤーは常に同じ側で一緒に試合に配置されます。
th: ผู้เล่นในทีมจะถูกจับคู่ในการแข่งขันด้วยกันเสมอในข้างเดียวกัน

source: Points
ja: 何点
th: คะแนน

source: predicted winner
ja: 予測される勝者
th: ผู้ชนะที่คาดการณ์

source: Queue
ja: キュー
th: คิว

source: Queue All
ja: すべてキューに入れる
th: จัดคิวทั้งหมด

source: Queue All Players
ja: すべてのプレイヤーをキューに入れる
th: จัดคิวผู้เล่นทั้งหมด

source: Queue Match
ja: 試合をキューに入れる
th: จัดคิวแมทช์

source: Random
ja: ランダムで
th: สุ่ม

source: Recommended Match
ja: 推奨試合
th: แมทช์ที่แนะนำ

source: right team players
ja: 右チームのプレイヤー
th: ผู้เล่นทีมขวา

source: save
ja: 保存
th: บันทึก

source: Save
ja: 保存
th: บันทึก

source: Select
ja: 選択
th: เลือก

source: Select a tab
ja: タブを選択
th: เลือกแท็บ

source: Set as Female
ja: 女性に設定
th: ตั้งเป็นหญิง

source: Set as Male
ja: 男性に設定
th: ตั้งเป็นชาย

source: Set this to the number of players currently resting to enable even leveling of match counts. Set to 0 to disable and optimize match quality instead, but this may result in some players playing more matches than others.
ja: これを設定すると、現在の休憩中のプレイヤーの数に合わせて、試合数を均等にします。 0に設定して無効にし、代わりに試合の質を最適化しますが、これにより、一部のプレイヤーが他のプレイヤーよりも多くの試合をプレイする可能性があります。
th: กำหนดจำนวนผู้เล่นที่กำลังพักเพื่อให้การแจกจับคู่เท่าๆ กัน ตั้งค่าเป็น 0 เพื่อปิดการใช้งานและปรับปรุงคุณภาพการแข่งขัน แต่ อาจทำให้ผู้เล่นบางคนเล่นมากกว่าคนอื่น

source: Start Session
ja: セッションを開始
th: เริ่มเซสชั่น

source: START SESSION
th: เริ่มเซสชั่น

source: Submit Rated
ja: 評価を提出
th: ส่งผลที่มีเรตติ้ง

source: SUBMIT RESULTS
ja: 結果を提出
th: ส่งผลลัพธ์

source: Submitted Matches
ja: 提出された試合
th: แมทช์ที่ส่งแล้ว

source: Team {0}
ja: チーム {0}
th: ทีม {0}

source: This team has played before
ja: このチームは以前にプレイしました
th: ทีมนี้เคยเล่นกันมาก่อน

source: Totally random teams.
ja: 完全にランダムなチーム。
th: ทีมสุ่มสิ้นเชิง

source: Unqueue All
ja: すべてのキューを解除
th: ยกเลิกคิวทั้งหมด

source: Winner
ja: 勝者
th: ผู้ชนะ

source: Badminton
ja: バドミントン
th: แบดมินตัน

source: Table Tennis
ja: 卓球
th: ปิงปอง

source: Pickleball
ja: ピックルボール
th: พิคเคิลบอล

source: Futsal
ja: フットサル
th: ฟุตซอล

source: [location missing]
ja: [場所がありません]
th: [ไม่มีสถานที่]

source: [missing title]
ja: [タイトルがありません]
th: [ไม่มีหัวข้อ]

source: {0} hour
ja: {0}時間
th: {0} ชั่วโมง

source: {0} hours
ja: {0}時間
th: {0} ชั่วโมง

source: {0} minute
ja: {0}分
th: {0} นาที

source: {0} minutes
ja: {0}分
th: {0} นาที

source: {playersCount, plural, one {player} other {players}}
ja: {playersCount, plural, one {プレイヤー} other {プレイヤー}}
th: ผู้เล่น

source: 🚫 CANCELED
ja: 🚫 キャンセル
th: 🚫 ยกเลิก

source: clear filter
ja: フィルターをクリア
th: ล้างตัวกรอง

source: filtering by date
ja: 日付でフィルタリング
th: กรองตามวันที่

source: join event
ja: 参加する
th: เข้าร่วมกิจกรรม

source: joined
ja: 参加
th: เข้าร่วมแล้ว

source: leave event
ja: 離れる
th: ออกจากกิจกรรม

source: pending
ja: 保留中
th: รอการอนุมัติ

source: players
ja: プレイヤー
th: ผู้เล่น

source: share as text
ja: テキストとして共有
th: แชร์เป็นข้อความ

source: show
ja: 表示
th: แสดง

source: waitlist
ja: ウェイトリスト
th: รายชื่อคอย

source: Basketball
ja: バスケットボール
th: บาสเก็ตบอล

source: Volleyball
ja: バレーボール
th: วอลเลย์บอล

source: {0} event details
ja: {0} イベント詳細
th: รายละเอียดกิจกรรม {0}

source: {0} events created!
ja: {0} イベントが作成されました！
th: สร้างกิจกรรมแล้ว {0} กิจกรรม!

source: activity
ja: アクティビティ
th: กิจกรรม

source: activity is required
ja: アクティビティが必要です
th: ต้องระบุกิจกรรม

source: create multiple events at one time
ja: 一度に複数のイベントを作成
th: สร้างหลายกิจกรรมในครั้งเดียว

source: events
ja: 私のイベント
th: กิจกรรม

source: events preview
ja: イベントプレビュー
th: ตัวอย่างกิจกรรม

source: input is required
ja: タイトルが必要です
th: ต้องกรอกข้อมูล

source: list publicly
ja: 一般公開リスト
th: แสดงสาธารณะ

source: loading...
ja: 読み込み中...
th: กำลังโหลด...

source: preview events
ja: イベントをプレビュー
th: ดูตัวอย่างกิจกรรม

source: show your event publicly on our home page. Otherwise, only people with a link to your event will be able to find it.
ja: ホームページでイベントを一般公開します。それ以外の場合、イベントへのリンクを持っている人だけがイベントを見つけることができます。
th: แสดงกิจกรรมของคุณแบบสาธารณะในหน้าแรกของเรา มิฉะนั้นจะมีเพียงคนที่มี ลิงค์ไปยังกิจกรรมของคุณเท่านั้นที่จะสามารถค้นหาได้

source: type your events in the format above
ja: 上記の形式でイベントを入力してください
th: พิมพ์กิจกรรมของคุณในรูปแบบข้างต้น

source: about
ja: 約
th: เกี่ยวกับ

source: club
ja: クラブ
th: คลับ

source: main activity
ja: 主なアクティビティ
th: กิจกรรมหลัก

source: Delete team
th: ลบทีม

source: Edit team
th: แก้ไขทีม

source: New Anti-Team
th: แอนตี้ทีมใหม่

source: New Team
th: ทีมใหม่

source: from the club?
th: จากคลับหรือไม่?

source: Classic round-robin draws
th: การจับสลากแบบรอบโรบินคลาสสิก

source: Last Round
th: รอบที่แล้ว

source: Players will be divided into similar skill level groups that round-robin with teams balanced by skill.
th: ผู้เล่นจะถูกแบ่งเป็นกลุ่มระดับทักษะที่ใกล้เคียงกันและแข่งขันแบบรอบโรบินโดยทีมจะสมดุลตามทักษะ

source: Repeat
th: ซ้ำ

source: Reset this round with mixed gender pairs
th: รีเซ็ตรอบนี้ด้วยคู่ผสมเพศ

source: Round-Robin
th: รอบโรบิน

source: Round-Robin with teams balanced by skill.
th: รอบโรบินกับทีมที่สมดุลตามทักษะ

source: Book a court and post the event to Pkuru.com. Please mention the participation cost and the expected level (3.0, 3.5, 4.0, etc). If you are new to the community, we recommend you to offer the court for free.
th: จองคอร์ตและโพสต์กิจกรรมบน Pkuru.com โปรดระบุค่าใช้จ่ายในการเข้าร่วมและระดับที่คาดหวัง (3.0, 3.5, 4.0 เป็นต้น) หากคุณเป็นคนใหม่ในชุมชน เราแนะนำให้เสนอคอร์ตฟรี

source: Create an Event at Pickleball One
th: สร้างกิจกรรมที่ Pickleball One

source: One full court is available and one \"fun\" court (half-sized). The full court has narrow space on the sides.
th: มีคอร์ตเต็ม 1 คอร์ตและคอร์ต "สนุก" (ขนาดครึ่ง) 1 คอร์ต คอร์ตเต็มมีพื้นที่ด้านข้างแคบ

source: Pickleball One Ginza Shimbashi (indoor hard court)
th: Pickleball One Ginza Shimbashi (คอร์ตแข็งในร่ม)

source: Post it to the Pickeball in Tokyo Facebook Group:
th: โพสต์ไปยังกลุ่ม Facebook Pickleball in Tokyo:

source: main activity is required
ja: 主なアクティビティが必要です
th: ต้องระบุกิจกรรมหลัก

source: name
ja: 場所名
th: ชื่อ

source: name is required
ja: 場所名は必須
th: ต้องระบุชื่อ

source: slug
ja: スラッグ
th: สลัก

source: tell people about your club
ja: あなたのクラブについて人々に伝える
th: บอกคนอื่นเกี่ยวกับคลับของคุณ

source: url slug is required
ja: URLスラッグが必要です
th: ต้องระบุ URL slug

source: address
ja: 住所
th: ที่อยู่

source: address is required
ja: 住所が必要です
th: ต้องระบุที่อยู่

source: Akabane Elementary School
ja: 赤羽小学校
th: โรงเรียนประถม Akabane

source: details
ja: 詳細
th: รายละเอียด

source: Instructions or information that will apply to all events held at this location.
ja: この場所で開催されるすべてのイベントに適用される指示または情報。
th: คำแนะนำหรือข้อมูลที่จะใช้กับกิจกรรมทั้งหมดที่จัดขึ้นใน สถานที่นี้

source: location
ja: 場所
th: สถานที่

source: maps link
ja: マップリンク
th: ลิงก์แผนที่

source: drill
th: ฝึกซ้อม

source: comp
th: แข่ง

source: rec
th: บันเทิง

source: all level
th: ทุกระดับ

source: add new club
ja: 新しいクラブを追加
th: เพิ่มคลับใหม่

source: Advanced players
th: ผู้เล่นระดับสูง

source: All Level
ja: すべてのレベル
th: ทุกระดับ

source: any details from the location will already be included. Mention any additional event-specific instructions, rules, or details.
ja: ロケ地からの詳細はすでに含まれています。その他のイベント特有の指示、規則、詳細」があれば記載してください。
th: รายละเอียดใดๆ จากสถานที่จะถูกรวมไว้แล้ว ระบุ คำแนะนำ กฎ หรือรายละเอียดเพิ่มเติมเฉพาะกิจกรรม

source: choose the club where this event will be held.
ja: このイベントが開催されるクラブを選択してください。
th: เลือกคลับที่จะจัดกิจกรรมนี้

source: date and start time
ja: 日付と開始時刻
th: วันที่และเวลาเริ่มต้น

source: details specific to this event on the specified date and time.
ja: 指定された日時のこのイベントに特有の詳細。
th: รายละเอียดเฉพาะกิจกรรมนี้ในวันที่และเวลาที่กำหนด

source: edit the location to edit the details for this location.
ja: この場所の詳細を編集するには、場所を編集します。
th: แก้ไขสถานที่เพื่อแก้ไขรายละเอียดสำหรับสถานที่นี้

source: end time
ja: 終了時刻
th: เวลาสิ้นสุด

source: end time is required
ja: 終了時刻が必要です
th: ต้องระบุเวลาสิ้นสุด

source: event date is required
ja: イベント日付が必要です
th: ต้องระบุวันที่กิจกรรม

source: event details
ja: イベント詳細
th: รายละเอียดกิจกรรม

source: Event tag: {tag}
th: แท็กกิจกรรม: {tag}

source: Highly skilled players
th: ผู้เล่นที่มีทักษะสูงมาก

source: level of play
th: ระดับการเล่น

source: location details
ja: 場所の詳細
th: รายละเอียดสถานที่

source: Lower intermediate and above
th: ระดับกลางขั้นต้นขึ้นไป

source: Matches will be submitted to DUPR.
th: การแข่งขันจะถูกส่งไปยัง DUPR

source: max participants
ja: 最大参加者数
th: ผู้เข้าร่วมสูงสุด

source: minimum rating
ja: 最低評価
th: เรตติ้งต่ำสุด

source: No restriction on skill level. Open to all players.
th: ไม่จำกัดระดับทักษะ เปิดให้ผู้เล่นทุกคน

source: Professional players
th: ผู้เล่นมืออาชีพ

source: Recreational play that will not be submitted to competitive ratings nor DUPR.
th: การเล่นเพื่อความบันเทิงที่จะไม่ถูกส่งไปยังเรตติ้งการแข่งขันหรือ DUPR

source: Results will be submitted to competitive ratings.
th: ผลการแข่งขันจะถูกส่งไปยังเรตติ้งการแข่งขัน

source: select club
ja: クラブを選択
th: เลือกคลับ

source: Select tags that best describe this event
th: เลือกแท็กที่อธิบายกิจกรรมนี้ได้ดีที่สุด

source: Skills practice and drills focused on technique improvement
th: การฝึกฝนทักษะและการซ้อมเพื่อพัฒนาเทคนิค

source: This event is private. Please do not share this event without permission from the organizer.
th: กิจกรรมนี้เป็นกิจกรรมส่วนตัว กรุณาอย่าแชร์กิจกรรมนี้โดยไม่ได้รับอนุญาต จากผู้จัดงาน

source: timezone
ja: タイムゾーン
th: เขตเวลา

source: title
ja: タイトル
th: หัวข้อ

source: title is required
ja: タイトルが必要です
th: ต้องระบุหัวข้อ

source: type of event
th: ประเภทกิจกรรม

source: Upper intermediate and above
th: ระดับกลางขั้นบนขึ้นไป

source: guest list
ja: ゲストリスト
th: รายชื่อแขก

source: {0} hours and {1} minutes
ja: {0}時間{1}分
th: {0} ชั่วโมง {1} นาที

source: CANCELED
ja: キャンセル
th: ยกเลิก

source: Unknown club
th: คลับที่ไม่ทราบ

source: Unknown location
th: สถานที่ที่ไม่ทราบ

source: joined from waitlist
ja: ウェイトリストから参加
th: เข้าร่วมจากรายชื่อคอย

source: joined the event
ja: 参加しました
th: เข้าร่วมกิจกรรม

source: left the event
ja: 離れました
th: ออกจากกิจกรรม

source: No activity yet
th: ยังไม่มีกิจกรรม

source: Status message
th: ข้อความสถานะ

source: Type a status message for people to see... such as 'I will arrive at 19:00.'
ja: 「19:00に到着します」など、他の人が見るためのステータスメッセージを入力してください。
th: พิมพ์ข้อความสถานะสำหรับให้คนอื่นเห็น... เช่น 'ฉันจะมาถึงตอน 19:00 น.'

source: {0, plural, one {player} other {players}}
ja: {0, plural, one {プレイヤー} other {プレイヤー}}
th: ผู้เล่น

source: {maxRsvps, plural, one {player} other {players}}
ja: {maxRsvps, plural, one {プレイヤー} other {プレイヤー}}
th: ผู้เล่น

source: {waitlistCount, plural, one {player} other {players}}
ja: {waitlistCount, plural, one {プレイヤー} other {プレイヤー}}
th: ผู้เล่น

source: Are you sure you want to remove this person from the event?
ja: この人をイベントから削除してもよろしいですか？
th: คุณแน่ใจหรือไม่ว่าต้องการลบบุคคลนี้ออกจากกิจกรรม?

source: attendees
ja: 参加者
th: ผู้เข้าร่วม

source: confirmed
ja: 確認済み
th: ยืนยันแล้ว

source: load More
ja: もっと読み込む
th: โหลดเพิ่มเติม

source: login to join the event
ja: イベントに参加するにはログインしてください
th: เข้าสู่ระบบเพื่อเข้าร่วมกิจกรรม

source: login with Line
ja: Lineでログイン
th: เข้าสู่ระบบด้วย Line

source: Remove from event
ja: イベントから削除
th: ลบจากกิจกรรม

source: Remove this RSVP
ja: このRSVPを削除
th: ลบการยืนยันนี้

source: Required rating: {0} (DUPR {1})
th: เรตติ้งที่ต้องการ: {0} (DUPR {1})

source: spots available
ja: 利用可能なスポット
th: ที่ว่าง

source: This event is full, so leaving the event will give your spot to someone on the waitlist. If you rejoin, you will join the waitlist. Are you sure you want to leave this event?
ja: このイベントは満員です。イベントを離れると、あなたのスポットはウェイトリストの誰かに譲られます。再参加する場合、ウェイトリストに参加することになります。本当にこのイベントを離れますか？
th: กิจกรรมนี้เต็มแล้ว การออกจากกิจกรรมจะให้ที่นั่งของคุณกับคนใน รายชื่อคอย หากคุณเข้าร่วมใหม่ คุณจะเข้าสู่รายชื่อคอย คุณแน่ใจ ว่าต้องการออกจากกิจกรรมนี้หรือไม่?

source: You will lose your spot
ja: あなたのスポットを失います
th: คุณจะเสียที่นั่ง

source: you're going :)
ja: あなたは行く :)
th: คุณจะไป :)

source: you're waitlisted :(
ja: あなたはウェイトリストに入っています :(
th: คุณอยู่ในรายชื่อคอย :(

source: Your rating {0} ~ {1} (DUPR {2} ~ {3}) is too low. You will be placed in the pending list until the rating limit is lowered. Please join another JPL rated event to boost your rating.
ja: あなたのレーティング{0} ~ {1} (DUPR {2} ~ {3})は低すぎます。レーティングの上限が下がるまで保留リストに登録されます。レーティングを上げるために別のJPL評価イベントに参加してください。
th: เรตติ้งของคุณ {0} ~ {1} (DUPR {2} ~ {3}) ต่ำเกินไป คุณจะถูกใส่ใน รายชื่อรอจนกว่าขีดจำกัดเรตติ้งจะลดลง กรุณาเข้าร่วมกิจกรรม JPL อื่นที่มีการให้คะแนนเพื่อเพิ่มเรตติ้งของคุณ

source: Confirmed
th: ยืนยันแล้ว

source: Join Event
th: เข้าร่วมกิจกรรม

source: Leave Event
th: ออกจากกิจกรรม

source: Load more
th: โหลดเพิ่มเติม

source: Login to Join
th: เข้าสู่ระบบเพื่อเข้าร่วม

source: No players yet
th: ยังไม่มีผู้เล่น

source: Pending
th: รอการอนุมัติ

source: Rating Too Low
th: เรตติ้งต่ำเกินไป

source: RSVPs
th: การยืนยันเข้าร่วม

source: Waitlist
th: รายชื่อคอย

source: ...load past events
ja: ...過去のイベントを読み込む
th: ...โหลดกิจกรรมที่ผ่านมา

source: {0} private {shadowCountDesc} hidden
ja: {0} プライベート {shadowCountDesc} 隠された
th: {0} ส่วนตัว {shadowCountDesc} ถูกซ่อน

source: {shadowCount, plural, one {event} other {events}}
ja: {shadowCount, plural, one {イベント} other {イベント}}
th: กิจกรรม

source: copyright the racquet league contributors
ja: 著作権ラケットリーグの寄稿者
th: ลิขสิทธิ์โดยผู้ร่วมงาน the racquet league

source: (logout)
ja: (サインアウト)
th: (ออกจากระบบ)

source: About
ja: について
th: เกี่ยวกับ

source: Find Games
ja: ゲームを見つける
th: ค้นหาเกม

source: Logout
ja: ログアウト
th: ออกจากระบบ

source: Open main menu
ja: メインメニューを開く
th: เปิดเมนูหลัก

source: Open user menu
ja: ユーザーメニューを開く
th: เปิดเมนูผู้ใช้

source: Profile picture
ja: プロフィール写真
th: รูปโปรไฟล์

source: Rankings
ja: ランキング
th: อันดับ

source: View notifications
ja: 通知を表示
th: ดูการแจ้งเตือน

source: Your Profile
ja: あなたのプロフィール
th: โปรไฟล์ของคุณ

source: ...load previous matches
ja: 前のものを読み込む
th: ...โหลดแมทช์ก่อนหน้า

source: Load more matches...
ja: もっとプレイヤーを読み込む...
th: โหลดแมทช์เพิ่มเติม...

source: Score:
ja: スコア:
th: คะแนน:

source: racquet league
ja: ラケットリーグ
th: แรคเก็ต ลีก

source: My Clubs
ja: 私のクラブ
th: คลับของฉัน

source: My Events
ja: 私のイベント
th: กิจกรรมของฉัน

source: Settings
ja: 設定
th: การตั้งค่า

source: ...load higher rated players
ja: ... より高い評価のプレイヤーを読み込む
th: ...โหลดผู้เล่นเรตติ้งสูงกว่า

source: Female
ja: 女性
th: หญิง

source: Load more players...
ja: もっとプレイヤーを読み込む...
th: โหลดผู้เล่นเพิ่มเติม...

source: Male
ja: 男性
th: ชาย

source: +{0} more
th: +{0} คน

source: Going
th: จะไป

source: Join
th: เข้าร่วม

source: RSVP
th: ยืนยันการเข้าร่วม

source: Show all
th: แสดงทั้งหมด

source: Show less
th: แสดงน้อยลง

source: You're Going
th: คุณจะไป

source: You're Waitlisted
th: คุณอยู่ในรายชื่อคอย

source: seeking a doubles partner
ja: ダブルスパートナーを探しています
th: กำลังมองหาคู่คู่

source: shows a badge next to your name in RSVP lists to tell people you are looking for a partner
ja: RSVPリストのあなたの名前の横にバッジを表示し、あなたが探していることを伝えます。
th: แสดงป้ายข้างชื่อของคุณในรายชื่อ RSVP เพื่อบอกคนอื่นว่าคุณกำลังมองหา คู่หู

source: change location
ja: 場所を変更
th: เปลี่ยนสถานที่

source: choose the location where this event will be held.
ja: このイベントが開催される場所を選択してください。
th: เลือกสถานที่ที่จะจัดกิจกรรมนี้

source: event location
ja: イベント場所
th: สถานที่จัดกิจกรรม

source: add new location
ja: 新しい場所を追加
th: เพิ่มสถานที่ใหม่

source: Match Count
ja: 試合数
th: จำนวนแมทช์

source: biography
ja: バイオグラフィー
th: ประวัติส่วนตัว

source: details about yourself
ja: 自己紹介
th: รายละเอียดเกี่ยวกับตัวคุณ

source: full name
ja: フルネーム
th: ชื่อเต็ม

source: profile
ja: プロフィール
th: โปรไฟล์

source: Some events require your legal name as shown on an ID card.
ja: 一部のイベントでは、IDカードに表示されている通りの法的名前が必要です。
th: กิจกรรมบางกิจกรรมต้องการชื่อจริงของคุณตามที่แสดงในบัตรประจำตัว

source: tell us a little about yourself
ja: 自己紹介をしてください
th: เล่าให้ฟังเกี่ยวกับตัวคุณสักนิด

source: Approve
th: อนุมัติ

source: Are you sure you want to remove {0} from the club?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ {0} ออกจากคลับ?

source: club not found
ja: クラブが見つかりません
th: ไม่พบคลับ

source: Members
th: สมาชิก

source: No members found
th: ไม่พบสมาชิก

source: Remove
th: ลบ

source: Remove member?
th: ลบสมาชิกหรือไม่?

source: Cancel Request
th: ยกเลิกคำขอ

source: Click the link to select it for easy copying.
ja: リンクをクリックして、簡単にコピーできるように選択してください。
th: คลิกลิงก์เพื่อเลือกและคัดลอกได้ง่าย

source: Leave club
th: ออกจากคลับ

source: Manage Members
th: จัดการสมาชิก

source: Request to join
th: ขอเข้าร่วม

source: Shareable Link
ja: 共有可能なリンク
th: ลิงก์ที่แชร์ได้

source: club doesn't exist.
ja: クラブが存在しません。
th: ไม่มีคลับนี้

source: location doesn't exist.
ja: 場所が存在しません。
th: ไม่มีสถานที่นี้

source: Events
ja: イベント
th: กิจกรรม

source: Racquet League
ja: ラケットリーグ
th: แรคเก็ต ลีก

source: All
ja: すべて
th: ทั้งหมด

source: cancel event
ja: イベントをキャンセル
th: ยกเลิกกิจกรรม

source: edit event
ja: イベントを編集
th: แก้ไขกิจกรรม

source: event @
ja: イベント @
th: กิจกรรม @

source: event doesn't exist
ja: イベントが存在しません
th: ไม่มีกิจกรรมนี้

source: good luck, have fun
ja: がんばってください
th: ขอให้โชคดี สนุกได้

source: hosted by {name}
ja: {name}主催
th: จัดโดย {name}

source: league
ja: ラケットリーグ
th: ลีก

source: login to subscribe to {activityName} events
ja: ログインして{activityName}のイベントに登録
th: เข้าสู่ระบบเพื่อติดตามกิจกรรม {activityName}

source: media
ja: メディア
th: สื่อ

source: notes
ja: メモ
th: หมายเหตุ

source: showing up without permission may result in a ban for failing to follow rules.
ja: 許可なしで参加することは、ルールに従わなかったために禁止される可能性があります。
th: การมาโดยไม่ได้รับอนุญาตอาจส่งผลให้ถูกแบนเนื่องจากการไม่ปฏิบัติตาม กฎ

source: submit matches
ja: 試合を提出
th: ส่งผลแมทช์

source: subscribe to all {activityName} events
ja: {activityName} のすべてのイベントに登録
th: ติดตามกิจกรรม {activityName} ทั้งหมด

source: sync calendar
ja: カレンダー同期
th: ซิงค์ปฏิทิน

source: this is a private event that requires membership with the club. To join this club, please join a Japan Pickleball League event first to get a referral.
ja: これはクラブのメンバーシップが必要なプライベートイベントです。このクラブに参加するには、まず日本ピクルボールリーグのイベントに参加してください。
th: นี่เป็นกิจกรรมส่วนตัวที่ต้องการสมาชิกภาพกับคลับ หากต้องการเข้าร่วม คลับนี้ กรุณาเข้าร่วมกิจกรรม Japan Pickleball League ก่อนเพื่อขอการแนะนำ

source: uncancel event
ja: イベントをキャンセル解除
th: เลิกยกเลิกกิจกรรม

source: unsubscribe from {activityName} events
ja: {activityName} のイベントから登録解除
th: ยกเลิกการติดตามกิจกรรม {activityName}

source: view events
ja: イベントを見る
th: ดูกิจกรรม

source: you will receive email notifications for new events
ja: 新しいイベントについてメール通知を受け取ります
th: คุณจะได้รับการแจ้งเตือนทางอีเมลสำหรับกิจกรรมใหม่

source: Event not found
th: ไม่พบกิจกรรม

source: No event details provided.
th: ไม่มีรายละเอียดกิจกรรม

source: No location details provided.
th: ไม่มีรายละเอียดสถานที่

source: all events
ja: すべてのイベント
th: กิจกรรมทั้งหมด

source: badminton events
ja: バドミントンイベント
th: กิจกรรมแบดมินตัน

source: include private
ja: プライベートを含める
th: รวมกิจกรรมส่วนตัว

source: pickleball events
ja: ピクルボールイベント
th: กิจกรรมพิคเคิลบอล

source: By clicking on the Gear icon in the top left, you can go back to the start screen. At the bottom of this screen will be the match history.
ja: 左上の歯車アイコンをクリックすると、スタート画面に戻ることができます。この画面の下部には、試合の履歴が表示されます。
th: โดยการคลิกที่ไอคอนเกียร์ที่มุมซ้ายบน คุณสามารถกลับไปยัง หน้าจอเริ่มต้นได้ ที่ด้านล่างของหน้าจอนี้จะเป็นประวัติการแข่งขัน

source: Checkin Screen
ja: チェックイン画面
th: หน้าจอเช็คอิน

source: Editing Matches
ja: 試合の編集
th: การแก้ไขการแข่งขัน

source: Entering Results
ja: 結果の入力
th: การป้อนผลการแข่งขัน
