Repository: chrischen/racquetleague-ui
Catalog: src/locales/*.po
Languages: ja, th

source: From the Queue screen you can select some players (highlighted in green) and take some special actions for them such as creating a team, anti-team, or setting their genders. The team feature is important if you have a group of players (2 minimum) who always want to play together, often called a 'fixed-pair.' The gender is important if you want to use the Gender-Mixed doubles option when choosing matches.
ja: キュー画面から、いくつかのプレイヤー（緑色でハイライト）を選択し、チームの作成、アンチチームの設定、性別の設定などの特別なアクションを実行できます。チーム機能は、常に一緒にプレイしたいプレイヤーのグループ（最低2人）がいる場合に重要です。これは「固定ペア」と呼ばれることもあります。性別は、男女混合ダブルスのオプションを選択する場合に重要です。
th: จากหน้าจอคิว คุณสามารถเลือกผู้เล่นบางคน (ไฮไลต์เป็นสีเขียว) และ ทำการกระทำพิเศษกับพวกเขา เช่น การสร้างทีม แอนตี้-ทีม หรือ ตั้งค่าเพศ คุณสมบัติทีมมีความสำคัญหากคุณมีกลุ่ม ผู้เล่น (อย่างน้อย 2 คน) ที่ต้องการเล่นด้วยกันเสมอ มักเรียกว่า 'คู่คงที่' เพศมีความสำคัญหากคุณต้องการใช้ตัวเลือกคู่ผสมเพศ เมื่อเลือกการแข่งขัน

source: Generating Draws
ja: ドローの生成
th: การสร้างการจับคู่

source: How to use FairPlay
ja: FairPlayの使い方
th: วิธีการใช้ FairPlay

source: If you enabled offline mode, you can go down this list and submit the results to Pkuru.com. Simply tap on the match, then click on the Submit button. Once the score shows 0 and 0 then it has successfully submitted. This step is not necessary if you did not enable offline mode. In normal Online Mode matches will be submitted as soon as you complete them from the Matches screen.
ja: オフラインモードを有効にした場合は、このリストを下にスクロールして結果をPkuru.comに送信できます。試合をタップし、送信ボタンをクリックするだけです。スコアが0と0で表示されたら、正常に送信されています。オフラインモードを有効にしていない場合、この手順は必要ありません。通常のオンラインモードでは、試合画面で完了するとすぐに試合結果が送信されます。
th: หากคุณเปิดใช้งานโหมดออฟไลน์ คุณสามารถดูรายการนี้และส่งผล ไปยัง Pkuru.com แค่แตะที่การแข่งขัน จากนั้นคลิกปุ่มส่ง เมื่อคะแนนแสดง 0 และ 0 แสดงว่าส่งสำเร็จแล้ว ขั้นตอนนี้ไม่จำเป็นหากคุณไม่ได้เปิดใช้งานโหมดออฟไลน์ ในโหมด ออนไลน์ปกติ การแข่งขันจะถูกส่งทันทีที่คุณเสร็จสิ้นจาก หน้าจอการแข่งขัน

source: Launching FairPlay
ja: FairPlayの起動
th: การเปิดตัว FairPlay

source: Manage Courts and Player Breaks
ja: コートとプレイヤーの休憩管理
th: การจัดการสนามและการพักของผู้เล่น

source: Matches Screen
ja: 試合画面
th: หน้าจอการแข่งขัน

source: On the bottom left you can select the number of courts under management by the app. When it is set to a value greater than 0, the app will automatically track the number of times everyone has played and determine who should be taking a break. Players who should be taking a break will be highlighted in yellow. This is a suggestion, so you can still tap on them to select them for the next match.
ja: 左下で、アプリで管理するコートの数を選択できます。0より大きい値に設定すると、アプリは全員がプレイした回数を自動的に追跡し、誰が休憩すべきかを判断します。休憩すべきプレイヤーは黄色でハイライトされます。これは提案なので、タップして次の試合に選択することもできます。
th: ที่ด้านล่างซ้าย คุณสามารถเลือกจำนวนสนามที่อยู่ภายใต้การจัดการของ แอป เมื่อตั้งค่ามากกว่า 0 แอปจะ ติดตามจำนวนครั้งที่ทุกคนเล่นโดยอัตโนมัติและกำหนด ว่าใครควรพัก ผู้เล่นที่ควรพักจะ ถูกไฮไลต์เป็นสีเหลือง นี่เป็นข้อเสนอแนะ ดังนั้นคุณยังสามารถแตะพวกเขาเพื่อ เลือกสำหรับการแข่งขันครั้งต่อไป

source: Once at least 4 players are selected (highlighted in green) from the Queue screen, you can generate draws with the blue button on the bottom right. The system will generate all possible combinations of matches for the given players based on the matchmaking strategy selected. Additionally it will show you the relative 'quality' of the matches and sort them from highest to lowest. Quality of the match means whether the match is going to be close or one-sided. The green highlighted match at the top is the 'recommended match' which uses some heuristics to select a match that balances quality while avoiding repeated teams or matches. The list of matches will also highlight previously played matches or pairs in yellow or red. This allows you as the organizer to determine whether to avoid repeated matches. Use the blue button to select a match which will then update the draws for the remaining players that were selected. Keep selecting matches until all players are in a match.
ja: キュー画面から少なくとも4人のプレイヤーが選択されると（緑色でハイライト）、右下の青いボタンでドローを生成できます。システムは、選択されたマッチメイキング戦略に基づいて、指定されたプレイヤーのすべての可能な試合の組み合わせを生成します。さらに、試合の相対的な「品質」を表示し、最高から最低まで並べ替えます。試合の品質とは、試合が接戦になるか一方的になるかを意味します。一番上の緑色でハイライトされた試合は「推奨試合」であり、いくつかのヒューリスティックを使用して、繰り返しのチームや試合を避けながら品質のバランスをとる試合を選択します。試合のリストは、以前にプレイされた試合やペアを黄色または赤色でハイライト表示します。これにより、主催者は繰り返しの試合を避けるかどうかを判断できます。青いボタンを使用して試合を選択すると、選択された残りのプレイヤーのドローが更新されます。すべてのプレイヤーが試合に参加するまで、試合を選択し続けます。
th: เมื่อเลือกผู้เล่นอย่างน้อย 4 คน (ไฮไลต์เป็นสีเขียว) จากหน้าจอคิว คุณสามารถสร้างการจับคู่ด้วยปุ่มสีน้ำเงินที่มุมล่างขวา ระบบ จะสร้างการจับคู่ที่เป็นไปได้ทั้งหมดสำหรับผู้เล่นที่กำหนด ตามกลยุทธ์การจับคู่ที่เลือก นอกจากนี้จะ แสดง 'คุณภาพ' สัมพัทธ์ของการแข่งขันและเรียงจากสูงสุดไปต่ำสุด คุณภาพของการแข่งขันหมายถึงการแข่งขันจะสนุกหรือ เอาชนะง่าย การแข่งขันที่ไฮไลต์สีเขียวที่ด้านบนคือ 'การแข่งขันที่แนะนำ' ซึ่งใช้วิธีการคำนวณเพื่อเลือกการแข่งขันที่สมดุลคุณภาพขณะ หลีกเลี่ยงทีมหรือการแข่งขันซ้ำ รายการการแข่งขันจะไฮไลต์ การแข่งขันหรือคู่ที่เล่นมาแล้วเป็นสีเหลืองหรือแดง ทำให้คุณในฐานะ ผู้จัดงานกำหนดได้ว่าจะหลีกเลี่ยงการแข่งขันซ้ำหรือไม่ ใช้ปุ่ม สีน้ำเงินเพื่อเลือกการแข่งขันซึ่งจะอัปเดตการจับคู่สำหรับผู้เล่น ที่เหลือที่ถูกเลือก เลือกการแข่งขันต่อไปจนกว่าผู้เล่นทุกคนจะอยู่ใน การแข่งขัน

source: Player Options
ja: プレイヤーオプション
th: ตัวเลือกผู้เล่น

source: Press the large blue button to launch the system. The 'Offline Mode' toggle should be used if there is no internet connection or if you want to test the system out without saving any results. In Offline mode, no submissions are made to Pkuru.com and if you delete the matches or close the web page there will be no permanent effects of your actions using the system. Additionally this screen shows the relative strengths of the players and at the bottom of the page there is a history of all the matches played.
ja: 大きな青いボタンを押してシステムを起動します。「オフラインモード」トグルは、インターネット接続がない場合や、結果を保存せずにシステムをテストしたい場合に使用します。オフラインモードでは、Pkuru.comへの送信は行われず、試合を削除したりウェブページを閉じたりしても、システムを使用したアクションの永続的な影響はありません。さらに、この画面にはプレイヤーの相対的な強さが表示され、ページの下部にはプレイされたすべての試合の履歴があります。
th: กดปุ่มสีน้ำเงินขนาดใหญ่เพื่อเปิดระบบ ตัวเลือก 'โหมดออฟไลน์' ควรใช้หากไม่มีการเชื่อมต่ออินเทอร์เน็ตหรือหากคุณต้องการทดสอบ ระบบโดยไม่บันทึกผล ในโหมดออฟไลน์ จะไม่มีการส่ง ไปยัง Pkuru.com และหากคุณลบการแข่งขันหรือปิดหน้าเว็บ จะไม่มีผลกระทบถาวรจากการกระทำของคุณในระบบ นอกจากนี้ หน้าจอนี้แสดงความแข็งแกร่งของผู้เล่นและที่ด้านล่างของ หน้ามีประวัติการแข่งขันทั้งหมดที่เล่น

source: Queue Screen
ja: キュー画面
th: หน้าจอคิว

source: Start Screen
ja: スタート画面
th: หน้าจอเริ่มต้น

source: Tapping on the names on the left side can select the winner without entering scores. Optionally, the exact score can be entered into the number field on the right side of each match. Once the green border is around the winner, the entry is complete and you can leave it as it is. Once results are entered for all matches, you can use the blue button on the bottom right to submit all the results at once.If you enabled offline mode, no results are submitted to Pkuru.com, but ratings will still be updated locally on your device. Additionally the predicted winner is shown in the red bar at the bottom.
ja: 左側の名前をタップすると、スコアを入力せずに勝者を選択できます。オプションで、各試合の右側にある数字フィールドに正確なスコアを入力できます。勝者の周りに緑色の境界線が表示されたら、入力は完了ですので、そのままにしておいてかまいません。すべての試合の結果が入力されたら、右下の青いボタンを使用してすべての結果を一度に送信できます。オフラインモードを有効にした場合、結果はPkuru.comに送信されませんが、評価はデバイス上でローカルに更新されます。さらに、予測される勝者が下部の赤いバーに表示されます。
th: การแตะชื่อที่ด้านซ้ายสามารถเลือกผู้ชนะได้โดยไม่ต้องป้อน คะแนน หรือสามารถป้อนคะแนนที่แน่นอนในช่องตัวเลขที่ ด้านขวาของแต่ละการแข่งขัน เมื่อมีขอบสีเขียวรอบผู้ชนะ การป้อนข้อมูลเสร็จสิ้นและคุณสามารถทิ้งไว้ได้ เมื่อป้อนผลสำหรับ การแข่งขันทั้งหมดแล้ว คุณสามารถใช้ปุ่มสีน้ำเงินที่มุมล่างขวาเพื่อ ส่งผลทั้งหมดพร้อมกัน หากคุณเปิดใช้งานโหมดออฟไลน์ จะไม่มีการส่งผล ไปยัง Pkuru.com แต่เรตติ้งจะยังคงถูกอัปเดตในเครื่องของคุณ นอกจากนี้ ผู้ชนะที่คาดการณ์จะแสดงในแถบสีแดงที่ ด้านล่าง

source: The FairPlay system can be launched from any event page on Pkuru.com. The system will automatically load all signed up players, including those in the waitlist. Players who did not join the event can be added as a guest, but their ratings and results cannot be saved to Pkuru.com.
ja: FairPlayシステムは、Pkuru.comのどのイベントページからでも起動できます。システムは、ウェイトリストにいるプレイヤーを含む、すべての登録済みプレイヤーを自動的に読み込みます。イベントに参加しなかったプレイヤーはゲストとして追加できますが、その評価と結果はPkuru.comに保存できません。
th: ระบบ FairPlay สามารถเปิดได้จากหน้ากิจกรรมใดๆ ใน Pkuru.com ระบบจะโหลดผู้เล่นที่ลงทะเบียนทั้งหมดโดยอัตโนมัติ รวมถึงคนใน รายชื่อคอย ผู้เล่นที่ไม่ได้เข้าร่วมกิจกรรมสามารถเพิ่มเป็นแขก แต่ เรตติ้งและผลของพวกเขาจะไม่สามารถบันทึกไปยัง Pkuru.com ได้

source: The handlebars on the left side of each name can be used to drag and drop the players into a different match or re-arrange the teams. If you press the Enter Score button you can select the winner and/or enter the score. If you want to cancel the match you can press the '...' button.
ja: 各名前の左側にあるハンドルバーを使用して、プレイヤーを別の試合にドラッグアンドドロップしたり、チームを再編成したりできます。「スコアを入力」ボタンを押すと、勝者を選択したり、スコアを入力したりできます。試合をキャンセルしたい場合は、「...」ボタンを押します。
th: บาร์ที่ด้านซ้ายของชื่อแต่ละคนสามารถใช้ลากและวาง ผู้เล่นไปยังการแข่งขันอื่นหรือจัดเรียงทีมใหม่ หากคุณกด ปุ่ม Enter Score คุณสามารถเลือกผู้ชนะและ/หรือป้อนคะแนน หากคุณ ต้องการยกเลิกการแข่งขัน คุณสามารถกดปุ่ม '...' ได้

source: The second screen is the Queue screen. This is where you can select players who want to play a match. On the bottom is a button to queue all players. This button will automatically select everyone and exclude the players who should be on break (highlighted in yellow). If you play matches in timed rounds, this is an easy way to select everyone who should participate in the next round of matches.
ja: 2番目の画面はキュー画面です。ここでは、試合をしたいプレイヤーを選択できます。下部には、すべてのプレイヤーをキューに入れるボタンがあります。このボタンは、休憩すべきプレイヤー（黄色でハイライト）を除いて、全員を自動的に選択します。時間制のラウンドで試合をする場合、これは次のラウンドに参加すべき全員を簡単に選択する方法です。
th: หน้าจอที่สองคือหน้าจอคิว นี่คือที่ที่คุณสามารถเลือกผู้เล่น ที่ต้องการเล่นการแข่งขัน ที่ด้านล่างมีปุ่มสำหรับเข้าคิวผู้เล่นทั้งหมด ปุ่มนี้จะเลือกทุกคนโดยอัตโนมัติและไม่รวมผู้เล่นที่ ควรพัก (ไฮไลต์เป็นสีเหลือง) หากคุณเล่นการแข่งขันแบบรอบจับเวลา นี่เป็นวิธีง่ายในการเลือกทุกคนที่ควรเข้าร่วมใน รอบการแข่งขันถัดไป

source: The system is composed of 3 main screns. The first is the checkin screen where you can enable/disable players for the session. Tap on a player's name to check them in. Green means the player is checked in. Check a player in if they are ready to play, and check them out if they are leaving early. If a player wants to take a break and it's not their turn yet, it's easiest to check them out and then check them back in next round.
ja: システムは3つの主要な画面で構成されています。最初の画面はチェックイン画面で、セッションのプレイヤーを有効/無効にできます。プレイヤーの名前をタップしてチェックインします。緑色はプレイヤーがチェックインしたことを意味します。プレイする準備ができている場合はプレイヤーをチェックインし、早く帰る場合はチェックアウトします。プレイヤーが休憩を取りたいが、まだ自分の番でない場合は、チェックアウトして次のラウンドで再度チェックインするのが最も簡単です。
th: ระบบประกอบด้วยหน้าจอหลัก 3 หน้าจอ หน้าจอแรกคือหน้าจอเช็คอิน ที่คุณสามารถเปิด/ปิดผู้เล่นสำหรับเซสชั่น แตะชื่อผู้เล่น เพื่อเช็คอิน สีเขียวหมายถึงผู้เล่นเช็คอินแล้ว เช็คอินผู้เล่นหาก พวกเขาพร้อมเล่น และเช็คเอาท์หากพวกเขากลับเร็ว หาก ผู้เล่นต้องการพักและยังไม่ถึงเที่ยน ก็ง่ายที่สุดคือ เช็คเอาท์แล้วเช็คอินใหม่ในรอบต่อไป

source: The third and final screen shows the active matches that are being played. The ordering of the teams is randomized, so you can use this to determine the serving team (usually the team on top).
ja: 3番目の最後の画面には、現在プレイされているアクティブな試合が表示されます。チームの順序はランダム化されているため、これを使用してサーブするチーム（通常は一番上のチーム）を決定できます。
th: หน้าจอที่สามและสุดท้ายจะแสดงการแข่งขันที่กำลังเล่น ลำดับของทีมเป็นแบบสุ่ม ดังนั้นคุณสามารถใช้กำหนด ทีมเซิร์ฟได้ (โดยทั่วไปจะเป็นทีมที่อยู่ด้านบน)

source: Find League Games
ja: リーグゲームを見つける
th: ค้นหาเกมลีก

source: To participate in the league and win prizes, please join the league events.
ja: リーグに参加して賞品を獲得するには、リーグのイベントに参加してください。
th: เพื่อเข้าร่วมลีกและชนะรางวัล กรุณาเข้าร่วมกิจกรรมลีก

source: Where to Play
ja: プレイする場所
th: สถานที่เล่น

source: About the League
ja: リーグについて
th: เกี่ยวกับลีก

source: Ratings are assigned to individual players just by playing doubles games, even with different partners each game. For doubles ratings we use OpenSkill (a derivative of TrueSkill), and for singles ratings we use Glicko2.
ja: ダブルスゲームをプレイするだけで、異なるパートナーとのゲームごとに個別のプレイヤーに評価が割り当てられます。ダブルスの評価にはOpenSkill（TrueSkillの派生）を使用し、シングルスの評価にはGlicko2を使用しています。
th: เรตติ้งจะถูกกำหนดให้ผู้เล่นแต่ละคนโดยการเล่นเกมคู่ แม้แต่ละเกมจะมีคู่คนต่างกัน สำหรับเรตติ้งคู่เราใช้ OpenSkill (อนุพันธ์ของ TrueSkill) และสำหรับเรตติ้งเดี่ยวเราใช้ Glicko2

source: The Japan Pickleball League is an open-source non-profit project to help improve the quality of community recreational pickleball games and events.
ja: 日本ピクルボールリーグは、コミュニティのレクリエーショナルピクルボールゲームとイベントの品質を向上させるためのオープンソース非営利プロジェクトです。
th: Japan Pickleball League เป็นโครงการโอเพ่นซอร์สไม่หากำไรเพื่อช่วย ปรับปรุงคุณภาพของเกมและกิจกรรมพิคเกิลบอลเพื่อความบันเทิงในชุมชน

source: The Tokyo Badminton League is an open-source non-profit project to help improve the quality of community recreational pickleball games and events.
ja: 東京バドミントンリーグは、コミュニティのレクリエーショナルピクルボールゲームとイベントの品質を向上させるためのオープンソース非営利プロジェクトです。
th: Tokyo Badminton League เป็นโครงการโอเพ่นซอร์สไม่หากำไรเพื่อช่วย ปรับปรุงคุณภาพของเกมและกิจกรรมพิคเกิลบอลเพื่อความบันเทิงในชุมชน

source: Loading matches...
ja: 試合を読み込んでいます...
th: กำลังโหลดแมทช์...

source: please login before managing the session
ja: セッションを管理する前にログインしてください
th: กรุณาล็อคอินก่อนจัดการเซสชั่น

source: japan pickle league
ja: 日本ピックルリーグ
th: ลีกพิคเกิลบอลญี่ปุ่น

source: Multiple colors available.
ja: 複数の色が利用可能です。
th: มีหลายสีให้เลือก

source: Next Prize: September 10
th: รางวัลครั้งต่อไป: 10 กันยายน

source: This prize will be awarded to the top male and female players on this day.
ja: この賞品は、この日のトップ男性プレイヤーと女性プレイヤーに授与されます。
th: รางวัลนี้จะมอบให้กับผู้เล่นชายและหญิงอันดับต้นในวันนี้

source: Tokyo Badminton League
ja: 東京バドミントンリーグ
th: ลีกแบดมินตันโตกยว

source: Estimated DUPR
ja: 推定DUPR
th: DUPR ที่คาดการณ์

source: Loading rankings...
ja: ランキングを読み込んでいます...
th: กำลังโหลดการจัดอันดับ...

source: Player Profile Page
ja: プレイヤープロフィールページ
th: หน้าโปรไฟล์ผู้เล่น

source: Rating
ja: 評価
th: เรตติ้ง

source: Competitive Doubles
th: คู่แข่งขัน

source: Play doubles games with different partners and receive an individual rating. Prizes are awarded monthly to top players.
ja: 異なるパートナーとダブルスゲームをプレイし、個別の評価を受け取ります。賞品は毎月トッププレイヤーに授与されます。
th: เล่นเกมคู่กับคู่คนต่างๆ และได้รับเรตติ้งส่วนบุคคล รางวัลจะมอบให้ผู้เล่นอันดับต้นทุกเดือน

source: Recreational Doubles
ja: レクリエーショナルダブルス
th: คู่เพื่อความบันเทิง

source: To participate, please join the events here:
ja: 参加するには、こちらのイベントに参加してください:
th: เพื่อเข้าร่วม กรุณาเข้าร่วมกิจกรรมที่นี่:

source: View My Profile
ja: 私のプロフィールを見る
th: ดูโปรไฟล์ของฉัน

source: page not found
ja: ページが見つかりません
th: ไม่พบหน้า

source: are you in a private browsing mode?
ja: プライベートブラウジングモードですか？
th: คุณอยู่ในโหมดท่องเว็บส่วนตัวหรือไม่?

source: login failed
ja: ログインに失敗しました
th: เข้าสู่ระบบไม่สำเร็จ

source: please try again outside of private browsing as it can interfere with Line login. if the problem persists, you can try the safe-mode login button below.
ja: Lineログインに影響を与える可能性があるため、プライベートブラウジング外で再試行してください。問題が解決しない場合は、下のセーフモードログインボタンを試してみてください。
th: กรุณาลองใหม่นอกโหมดการเรียกดูแบบส่วนตัว เนื่องจากอาจรบกวนการเข้าสู่ระบบ Line หากปัญหายังคงอยู่ คุณสามารถลองปุ่มเข้าสู่ระบบโหมดปลอดภัยด้านล่าง

source: safe-mode login with Line
ja: Lineでセーフモードログイン
th: เข้าสู่ระบบด้วย Line แบบปลอดภัย

source: cancel login
ja: ログインをキャンセル
th: ยกเลิกการเข้าสู่ระบบ

source: display name
ja: 表示名
th: ชื่อที่แสดง

source: email address
ja: メールアドレス
th: ที่อยู่อีเมล

source: event organizers and other users cannot view your email
ja: イベント主催者や他のユーザーはあなたのメールアドレスを見ることはできません
th: ผู้จัดกิจกรรมและผู้ใช้คนอื่นไม่สามารถดูอีเมลของคุณได้

source: notification of updates or cancellations to events (you can opt out)
ja: イベントの更新やキャンセルの通知（オプトアウト可能）
th: การแจ้งเตือนการอัปเดตหรือการยกเลิกกิจกรรม (คุณสามารถยกเลิกได้)

source: privacy disclosure
ja: プライバシー開示
th: การเปิดเผยความเป็นส่วนตัว

source: profile picture
ja: プロフィール写真
th: รูปโปรไฟล์

source: publicly displayed on event attendance lists
ja: イベント出席リストに公開されます
th: แสดงสาธารณะในรายชื่อผู้เข้าร่วมกิจกรรม

source: we will collect the following information from your Line account
ja: Lineアカウントから以下の情報を収集します
th: เราจะเก็บข้อมูลต่อไปนี้จากบัญชี Line ของคุณ

source: page not found.
ja: ページが見つかりません。
th: ไม่พบหน้า

source: As mentioned above, public games are not really a thing in Japan. However, you can find some public games on the home page of this website. They will tend to be full with a waitlist so just join the waitlist and cross your fingers. 5-6 spots tend to open up the day of the event as people cancel last minute.
ja: 前述の通り、日本では公開ゲームはあまり一般的ではありません。しかし、このウェブサイトのホームページでいくつかの公開ゲームを見つけることができます。これらは通常、ウェイティングリストで満員になる傾向があるので、ウェイティングリストに参加して幸運を祈ってください。イベント当日になると、直前のキャンセルで5〜6人分の空きが出ることがよくあります。
th: ดังที่กล่าวไว้ข้างต้น เกมสาธารณะไม่ใช่เรื่องทั่วไปในญี่ปุ่น อย่างไรก็ตาม คุณสามารถหาเกมสาธารณะบางเกมได้ที่หน้าแรกของเว็บไซต์นี้ มักจะเต็มและมีรายชื่อคอย แค่เข้าร่วมรายชื่อคอยและข้ามนิ้ว โดยทั่วไปจะมีที่ว่าง 5-6 ที่นั่งในวันกิจกรรม เนื่องจากมีคนยกเลิกในนาทีสุดท้าย

source: Book a court and find the players yourself.
ja: コートを予約して、自分でプレイヤーを見つけましょう。
th: จองสนามและหาผู้เล่นเอง

source: Book the Court
ja: コートを予約
th: จองสนาม

source: Create an Event at Hilton Tokyo Tennis Courts
ja: ヒルトン東京テニスコートでイベントを作成
th: สร้างกิจกรรมที่สนามเทนนิส Hilton Tokyo

source: Create an Event at KPI Park
ja: KPIパークでイベントを作成
th: สร้างกิจกรรมที่ KPI Park

source: Create an event at one of the locations above (use the buttons above). Make the event public so people can join you.
ja: 上記の場所のいずれかでイベントを作成します（上記のボタンを使用）。イベントを公開して、他の人が参加できるようにします。
th: สร้างกิจกรรมที่หนึ่งในสถานที่ข้างต้น (ใช้ปุ่มข้างต้น) ทำให้ กิจกรรมเป็นสาธารณะเพื่อให้คนอื่นเข้าร่วมกับคุณได้

source: Create an Event at Pacific Pickle Club
ja: パシフィックピックルクラブでイベントを作成
th: สร้างกิจกรรมที่ Pacific Pickle Club

source: Create an Event at Tokyo Tower Pickleball
ja: 東京タワーピックルボールでイベントを作成
th: สร้างกิจกรรมที่ Tokyo Tower Pickleball

source: Hilton Tokyo Tennis Courts (painted lines)
ja: ヒルトン東京テニスコート（ペイントライン）
th: สนามเทนนิส Hilton Tokyo (เส้นที่ทาสี)

source: How to Find Players in Tokyo
ja: 東京でプレイヤーを見つける方法
th: วิธีหาผู้เล่นในโตกยว

source: How to Find Public Games
ja: 公開ゲームの見つけ方
th: วิธีหาเกมสาธารณะ

source: How to Play Pickleball in Tokyo
ja: 東京でピックルボールをプレイする方法
th: วิธีเล่นพิคเกิลบอลในโตกยว

source: Japan does not really have public drop in courts or games. Most pickleball games happen indoors at community center and school gymnasiums (multi-use gyms) or on private tennis/pickleball courts and these all require reservations for court time, or reservations to join the events. Many of the public facilities do not allow groups to advertise to the public, which makes it difficult for new players or visitors to drop in on sessions.
ja: 日本では、一般の人が自由に利用できるコートやゲームはあまりありません。ほとんどのピックルボールの試合は、公民館や学校の体育館（多目的体育館）などの屋内、または民間のテニス/ピックルボールコートで行われ、これらはすべてコートの時間予約、またはイベントへの参加予約が必要です。多くの公共施設では、団体が一般に宣伝することを許可していないため、新しいプレイヤーや訪問者がセッションに飛び入り参加することが難しくなっています。
th: ญี่ปุ่นไม่ค่อยมีสนามหรือเกมสาธารณะที่สามารถเข้าไปเล่นได้ เกมพิคเกิลบอลส่วนใหญ่ เกิดขึ้นในอาคารภายในศูนย์ชุมชนและโรงยิมโรงเรียน (โรงยิมอเนกประสงค์) หรือในสนามเทนนิส/พิคเกิลบอลส่วนตัว และทั้งหมดต้อง จองล่วงหน้าสำหรับเวลาสนาม หรือจองล่วงหน้าเข้าร่วมกิจกรรม สถานที่สาธารณะหลายแห่งไม่อนุญาตให้กลุ่มโฆษณาสู่สาธารณะ ทำให้ผู้เล่นใหม่หรือนักท่องเที่ยวยากที่จะเข้าร่วมเซสชั่น

source: Join any public events on Pkuru.com (this website). If you find an event without the 'lock' icon and which has a join button, then you can join.
ja: Pkuru.com（このウェブサイト）で公開イベントに参加してください。「ロック」アイコンがなく、参加ボタンがあるイベントを見つけたら、参加できます。
th: เข้าร่วมกิจกรรมสาธารณะใดๆ ใน Pkuru.com (เว็บไซต์นี้) หากคุณพบกิจกรรม ที่ไม่มีไอคอน 'กุญแจ' และมีปุ่มเข้าร่วม คุณก็สามารถเข้าร่วมได้

source: KPI Park in Kanagawa/Yokohama
ja: 神奈川/横浜のKPIパーク
th: KPI Park ใน Kanagawa/Yokohama

source: Message @japanpickle on Instagram for referrals or questions
ja: 紹介や質問については、Instagramで@japanpickleにメッセージを送ってください
th: ส่งข้อความไปที่ @japanpickle ใน Instagram สำหรับการแนะนำหรือคำถาม

source: Pacific Pickle Club at Ariake
ja: 有明のパシフィックピックルクラブ
th: Pacific Pickle Club ที่ Ariake

source: Please do not show up to any events without permission and only if you are in the confirmed going list. Indoor events always require a set of clean indoor only court shoes. They are really serious about this stuff in Japan.
ja: 許可なくイベントに参加しないでください。参加が確定している方のみご参加いただけます。屋内イベントでは、常に清潔な室内専用のコートシューズが必要です。日本ではこの点について非常に厳しいです。
th: กรุณาอย่าไปกิจกรรมใดๆ โดยไม่ได้รับอนุญาต และเฉพาะเมื่อคุณ อยู่ในรายชื่อยืนยันที่จะเข้าร่วม กิจกรรมภายในอาคารต้องใช้ รองเท้าสะอาดเฉพาะสนามในอาคารเท่านั้น พวกเขาจริงจังเรื่องนี้ในญี่ปุ่น

source: Post it to the JPAA group on Facebook (mostly Japanese)
ja: FacebookのJPAAグループに投稿する（主に日本語）
th: โพสต์ลงกลุ่ม JPAA ใน Facebook (ส่วนใหญ่เป็นภาษาญี่ปุ่น)

source: Post it to the Yokosuka (US navy base) pickleball group on Facebook:
ja: Facebookの横須賀（米海軍基地）ピックルボールグループに投稿してください：
th: โพสต์ลงกลุ่มพิคเกิลบอล Yokosuka (ฐานทัพเรือสหรัฐฯ) ใน Facebook:

source: So, how can one play pickleball in Tokyo then as a tourist, recent transplant, or a beginner?
ja: では、観光客、最近移住してきた人、または初心者は、東京でどのようにピックルボールをプレイできるのでしょうか？
th: แล้วคนจะเล่นพิคเกิลบอลในโตกยวได้อย่างไร ในฐานะนักท่องเที่ยว คนย้ายมาใหม่ หรือผู้เริ่มต้น?

source: Some events are restricted by level. If you are restricted, just type in your DUPR rating as a comment with your RSVP.
ja: 一部のイベントはレベルによって制限されています。制限されている場合は、RSVPのコメントにDUPRレーティングを入力してください。
th: กิจกรรมบางอย่างมีการจำกัดตามระดับ หากคุณถูกจำกัด ให้พิมพ์ เรตติ้ง DUPR ของคุณเป็นคำอธิบายในการ RSVP

source: The courts require reservations but there are 10 courts and it's generally available last minute. Therefore you can book the courts just-in-time once you've already gathered the players.
ja: コートは予約が必要ですが、10面あり、通常は直前でも予約可能です。そのため、プレイヤーを集めてからジャストインタイムでコートを予約することができます。
th: สนามต้องการจองล่วงหน้า แต่มี 10 สนามและโดยทั่วไปจะ มีให้ในนาทีสุดท้าย ดังนั้นคุณจึงสามารถจองสนามตอนที่ รวมตัวผู้เล่นแล้ว

source: The courts require reservations but there are only 2 courts so you will need to book in advance. They also hold open play sessions but the level may be low to complete beginner.
ja: コートは予約が必要ですが、2面しかないので事前に予約する必要があります。オープンプレイセッションも開催していますが、レベルは初心者向けかもしれません。
th: สนามต้องการจองล่วงหน้า แต่มีเพียง 2 สนาม จึงต้องจองล่วงหน้า มีเซสชั่นเล่นเปิดด้วย แต่ระดับอาจต่ำถึงผู้เริ่มต้น

source: Tokyo Tower Pickleball
ja: 東京タワーピックルボール
th: พิคเกิลบอลโตกยวทาวเวอร์

source: Two courts are available. Conditions may be windy.
ja: コートは2面あります。風が強い場合があります。
th: มีสนาม 2 สนาม สภาพอาจมีลมแรง

source: Two courts are available. More expensive than other courts and the conditions can be windy.
ja: コートは2面あります。他のコートよりも高価で、風が強い場合があります。
th: มีสนาม 2 สนาม ราคาแพงกว่าสนามอื่น และ สภาพอาจมีลมแรง

source: Where to Book Courts in Tokyo
ja: 東京でコートを予約できる場所
th: ที่จองสนามในโตกยว

source: Event or Location doesn't exist.
ja: イベントまたは場所が存在しません。
th: ไม่มีกิจกรรมหรือสถานที่นี้

source: my clubs
ja: 私のクラブ
th: คลับของฉัน

source: You are not an admin of any clubs.
th: คุณไม่ได้เป็นแอดมินของคลับใด ๆ

source: my events
ja: 私のイベント
th: กิจกรรมของฉัน

source: public events
ja: 公開イベント
th: กิจกรรมสาธารณะ

source: View Profile
th: ดูโปรไฟล์

source: See all
th: ดูทั้งหมด

source: Collapse
th: ย่อ

source: Join Waitlist
ja: ウェイトリストに参加
th: เข้าร่วมรายชื่อคอย

source: RSVP Pending...
th: กำลังรอการอนุมัติ...

source: Manage Event
th: จัดการกิจกรรม

source: Approve RSVP
th: อนุมัติ RSVP

source: Move to Pending List
th: ย้ายไปรายชื่อรอ

source: This user will be removed from the Going/Waitlist. Their position will be lost if you move them back in. Are you sure you want to restrict their RSVP?
th: ผู้ใช้คนนี้จะถูกลบออกจากรายชื่อไป/รายชื่อคอย ตำแหน่งของพวกเขาจะหายไป หากคุณย้ายพวกเขากลับมา คุณแน่ใจหรือไม่ว่าต้องการจำกัด RSVP ของพวกเขา?

source: Add Member
th: เพิ่มสมาชิก

source: {0} {hiddenCountDesc} hidden
th: ซ่อนกิ{hiddenCountDesc} {0} รายการ

source: {totalHiddenCount, plural, one {event} other {events}}
th: {totalHiddenCount, plural, one {จกรรม} other {จกรรม}}
