Repository: chrischen/racquetleague-ui
Catalog: src/locales/*.po
Languages: ja, th

source: Create All Events
th: สร้างกิจกรรมทั้งหมด

source: Create This Event
th: สร้างกิจกรรมนี้

source: Date:
th: วันที่:

source: Description:
th: คำอธิบาย:

source: Error creating events. Please try again.
th: เกิดข้อผิดพลาดในการสร้างกิจกรรม กรุณาลองอีกครั้ง

source: Event Details
th: รายละเอียดกิจกรรม

source: Location:
th: สถานที่:

source: Suggested Events
th: กิจกรรมที่แนะนำ

source: Time:
th: เวลา:

source: Title:
th: ชื่อ:

source: Add an Event
th: เพิ่มกิจกรรม

source: Badminton every thursday next month at Akabane Elementary 7-9pm.
th: แบดมินตันทุกวันพฤหัสบดีเดือนหน้า ที่โรงเรียน Akabane 19:00-21:00

source: Need 5 players for KPI Park tomorrow 6-9pm. Split the cost.
th: ต้องการ 5 คน สำหรับ KPI Park พรุ่งนี้ 18:00-21:00 แชร์ค่าใช้จ่าย

source: AI Assistant
th: ผู้ช่วย AI

source: An error occurred. Please try again.
th: เกิดข้อผิดพลาด โปรดลองอีกครั้ง

source: Ask
th: ถาม

source: Describe the event you want to create...
th: บอกรายละเอียดกิจกรรมที่คุณต้องการสร้าง...

source: I couldn't process that request. Please try again.
th: ไม่สามารถประมวลผลคำขอนั้นได้ โปรดลองอีกครั้ง

source: Let me know when and where you'd like to play, and I'll help you create an event. You can continue talking to me in a conversation to refine any details.
th: บอกเราว่าคุณต้องการเล่นเมื่อไหร่และที่ไหน เราจะช่วยคุณสร้างกิจกรรม คุณสามารถพูดคุยต่อเพื่อปรับแต่งรายละเอียดได้

source: New
th: ใหม่

source: Processing...
th: กำลังประมวลผล...

source: Reply
th: ตอบกลับ

source: I can create events for you. Just give me your schedule.
th: ฉันสามารถสร้างกิจกรรมให้คุณได้ เพียงแค่บอกตารางของคุณ

source: Tell me the time and place of your event, or any other details. You can also let me know the details to include and I can even add the translations.
th: บอกเราเวลาและสถานที่ของกิจกรรม หรือรายละเอียดอื่นๆ คุณยังสามารถแจ้งรายละเอียดที่ต้องการให้รวมไว้ได้ และฉันยังสามารถเพิ่มการแปลได้อีกด้วย

source: Private Event
th: กิจกรรมส่วนตัว

source: This event is private and cannot be joined on Pkuru.com. Do not show up to the event without permission.
th: กิจกรรมนี้เป็นกิจกรรมส่วนตัวและไม่สามารถเข้าร่วมผ่าน Pkuru.com ได้ ห้ามไปที่กิจกรรมโดยไม่ได้รับอนุญาต

source: {0} of {1} checked in
th: เช็คอินแล้ว {0} จาก {1} คน

source: ACTIVE ROUND
th: รอบปัจจุบัน

source: Advance to Next Round
th: ไปยังรอบถัดไป

source: and generate new matches for {0} players
th: และสร้างคู่แข่งใหม่สำหรับผู้เล่น {0} คน

source: Available Courts:
th: สนามที่ใช้ได้:

source: Court {0}
th: สนาม {0}

source: Court {0} - Editing
th: สนาม {0} - กำลังแก้ไข

source: Current Round:
th: รอบปัจจุบัน:

source: delete all rounds below
th: ลบรอบด้านล่างทั้งหมด

source: Edit match
th: แก้ไขการแข่งขัน

source: Generate Draws
th: สร้างคู่แข่ง

source: Generate Initial Draws
th: สร้างคู่แข่งเริ่มต้น

source: Generate matches for {0} players across {1} {courtText}
th: สร้างการแข่งขันสำหรับผู้เล่น {0} คนใน {1} {courtText}

source: match
th: คู่แข่ง

source: matches
th: คู่แข่ง

source: Need {0} players for {1} {courtText}. Currently {2} checked in.
th: ต้องการผู้เล่น {0} คนสำหรับ {1} {courtText} ปัจจุบันเช็คอินแล้ว {2} คน

source: Player Check-in
th: เช็คอินผู้เล่น

source: Previous Round
th: รอบก่อนหน้า

source: Replace Future Rounds
th: แทนที่รอบถัดไป

source: Replace Rounds Below
th: แทนที่รอบด้านล่าง

source: Round {0}
th: รอบ {0}

source: Score
th: คะแนน

source: TEAM 1
th: ทีม 1

source: TEAM 2
th: ทีม 2

source: This will
th: สิ่งนี้จะ

source: was added to the event by admin
th: ถูกเพิ่มเข้ากิจกรรมโดยผู้ดูแลระบบ

source: was removed from the event by admin
th: ถูกลบออกจากกิจกรรมโดยผู้ดูแลระบบ

source: Delete match
th: ลบการแข่งขัน

source: TEAM {0}
th: ทีม {0}

source: ({0} players per round)
th: ({0} คนต่อรอบ)

source: All checked-in players are already in this round
th: ผู้เล่นที่เช็คอินแล้วมีอยู่ในรอบนี้ทั้งหมดแล้ว

source: Classic random round-robin draws
th: จับคู่แบบสุ่มแบบราวน์โรบิน

source: Courts:
th: คอร์ท:

source: Debug: OFF
th: ดีบัก: ปิด

source: Debug: ON
th: ดีบัก: เปิด

source: Enter Match Score
th: ป้อนคะแนนแมตช์

source: Generate
th: สร้าง

source: Losing Team (Team {0})
th: ทีมแพ้ (ทีม {0})

source: Mix players of different levels in matches but still split stronger players to balance teams.
th: ผสมผู้เล่นที่มีระดับต่างกัน แต่ยังแยกผู้เล่นที่แข็งกว่าเพื่อสมดุลทีม

source: No available players
th: ไม่มีผู้เล่นว่าง

source: No Score
th: ไม่มีคะแนน

source: Players will be divided into similar skill level groups that round-robin.
th: แบ่งผู้เล่นตามระดับทักษะที่ใกล้เคียงกันและแข่งขันแบบราวน์โรบิน

source: Rebalance this round with current players
th: ปรับสมดุลรอบนี้ด้วยผู้เล่นปัจจุบัน

source: Replace Player
th: เปลี่ยนผู้เล่น

source: Replacing:
th: กำลังเปลี่ยน:

source: Reset this round with all checked-in players
th: รีเซ็ตรอบนี้ด้วยผู้เล่นที่เช็คอินทั้งหมด

source: Save Score
th: บันทึกคะแนน

source: Scores Synced!
th: ซิงค์คะแนนเรียบร้อยแล้ว!

source: Skill: {0}
th: ทักษะ: {0}

source: Strategy:
th: กลยุทธ์:

source: Sync Failed
th: ซิงค์ล้มเหลว

source: Sync Scores
th: ซิงค์คะแนน

source: Syncing... {0}%
th: กำลังซิงค์... {0}%

source: This will delete all future rounds and generate new matches
th: จะลบรอบถัดไปทั้งหมดและสร้างแมตช์ใหม่

source: Winning Team (Team {0})
th: ทีมชนะ (ทีม {0})

source: Manage Event (Beta)
th: จัดการกิจกรรม (เบต้า)

source: strategy
th: กลยุทธ์

source: Update Future Rounds
th: อัปเดตรอบถัดไป

source: Update Rounds Below
th: อัปเดตรอบด้านล่าง

source: Adjust Player Seeds
th: ปรับซีดผู้เล่น

source: Create and manage player teams
th: สร้างและจัดการทีมผู้เล่น

source: Create your first team to get started
th: สร้างทีมแรกของคุณเพื่อเริ่มต้น

source: Drag players to reorder their initial seeding
th: ลากผู้เล่นเพื่อจัดเรียงซีดเริ่มต้นใหม่

source: Edit Team
th: แก้ไขทีม

source: Enter team name
th: ป้อนชื่อทีม

source: Gender
th: เพศ

source: mu
th: μ

source: Name
th: ชื่อ

source: No teams yet
th: ยังไม่มีทีม

source: Player ID
th: รหัสผู้เล่น

source: Player Settings
th: การตั้งค่าผู้เล่น

source: Reset Storage
th: รีเซ็ตที่เก็บข้อมูล

source: Save & Close
th: บันทึกและปิด

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Save Seed Adjustments
th: บันทึกการปรับซีด

source: Save Team
th: บันทึกทีม

source: Seeds Adjusted
th: ซีดที่ปรับแล้ว

source: Team Management
th: การจัดการทีม

source: Team Members ({0})
th: สมาชิกทีม ({0} คน)

source: Team Name
th: ชื่อทีม

source: Delete adjustment
th: ลบการปรับ

source: Rating Adjustment - Applied Before Round {0}
th: การปรับเรตติ้ง - ใช้ก่อนรอบที่ {0}

source: Anti-Team {0}
th: แอนตี้ทีม {0}

source: Anti-Teams
th: แอนตี้ทีม

source: Create your first anti-team to prevent players from pairing
th: สร้างแอนตี้ทีมแรกของคุณเพื่อป้องกันไม่ให้ผู้เล่นจับคู่กัน

source: No anti-teams yet
th: ยังไม่มีแอนตี้ทีม

source: Teams
th: ทีม

source: Check-in / Check-out
th: เช็คอิน / เช็คเอาท์

source: Court Management & Player Breaks
th: การจัดการสนามและการพักของผู้เล่น

source: Event Manager Icons
th: ไอคอนตัวจัดการกิจกรรม

source: How to use Event Manager
th: วิธีใช้ตัวจัดการกิจกรรม

source: In the **Matches** screen:\n \n1. Tap a match to open the result entry view.\n \n2. Select the winning team or enter the specific score.\n \n3. Once a winner is selected (green border), the result is ready.\n \n4. Click **Submit** to save the result and update ratings.
th: ในหน้าจอ **การแข่งขัน**:\n \n1. แตะการแข่งขันเพื่อเปิดมุมมองป้อนผลลัพธ์\n \n2. เลือกทีมที่ชนะหรือป้อนคะแนนที่แน่นอน\n \n3. เมื่อเลือกผู้ชนะแล้ว (กรอบสีเขียว) ผลลัพธ์พร้อมแล้ว\n \n4. คลิก **ส่ง** เพื่อบันทึกผลลัพธ์และอัปเดตคะแนน

source: In the Queue screen, select players to access special options:\n \n• **Create Team**: Link two players who always want to play together (Fixed Pair).\n \n• **Anti-Team**: Prevent two players from being paired together.\n \n• **Set Gender**: Override gender for Mixed Doubles matchmaking.
th: ในหน้าจอคิว เลือกผู้เล่นเพื่อเข้าถึงตัวเลือกพิเศษ:\n \n• **สร้างทีม**: เชื่อมโยงผู้เล่นสองคนที่ต้องการเล่นด้วยกันเสมอ (คู่คงที่)\n \n• **ทีมตรงข้าม**: ป้องกันไม่ให้ผู้เล่นสองคนถูกจับคู่เข้าด้วยกัน\n \n• **ตั้งค่าเพศ**: แทนที่เพศสำหรับการจับคู่ผสมชายหญิง

source: Player Options (Teams & Anti-Teams)
th: ตัวเลือกผู้เล่น (ทีมและทีมตรงข้าม)

source: The Event Manager uses several icons to help you navigate and manage your event:\n \n• **Gear Icon**: Access settings to change the number of courts, match generation strategy, and view match history.\n \n• **Checkmark/User Icon**: Used for checking players in and out of the session. Green indicates checked in.\n \n• **List/Queue Icon**: View the list of available players and select them for the next round.\n \n• **Play/Matches Icon**: View active matches and enter results.\n \n• **Trash Icon**: Delete a match (careful, this cannot be undone in some modes).
th: ตัวจัดการกิจกรรมใช้ไอคอนหลายตัวเพื่อช่วยคุณนำทางและจัดการกิจกรรม:\n \n• **ไอคอนเกียร์**: เข้าถึงการตั้งค่าเพื่อเปลี่ยนจำนวนสนาม กลยุทธ์การสร้างการแข่งขัน และดูประวัติการแข่งขัน\n \n• **ไอคอนเครื่องหมายถูก/ผู้ใช้**: ใช้สำหรับเช็คอินและเช็คเอาท์ผู้เล่นในเซสชั่น สีเขียวหมายถึงเช็คอินแล้ว\n \n• **ไอคอนรายการ/คิว**: ดูรายชื่อผู้เล่นที่มีอยู่และเลือกพวกเขาสำหรับรอบถัดไป\n \n• **ไอคอนเล่น/การแข่งขัน**: ดูการแข่งขันที่ใช้งานอยู่และป้อนผลลัพธ์\n \n• **ไอคอนถังขยะ**: ลบการแข่งขัน (ระวัง สิ่งนี้ไม่สามารถยกเลิกได้ในบางโหมด)

source: To generate matches:\n \n1. Go to the **Queue** screen.\n \n2. Select at least 4 players (highlighted in green). You can use the \"Queue All\" button to select everyone not on break.\n \n3. Click the **Generate Matches** button.\n \n4. The system will propose matches based on the selected strategy (e.g., Competitive, Mixed).\n \n5. You can accept the recommended matches or manually select from the list of possibilities.\n \n6. Quality indicators show how balanced a match is expected to be.
th: การสร้างการแข่งขัน:\n \n1. ไปที่หน้าจอ **คิว**\n \n2. เลือกผู้เล่นอย่างน้อย 4 คน (ไฮไลต์สีเขียว) คุณสามารถใช้ปุ่ม \"เข้าคิวทั้งหมด\" เพื่อเลือกทุกคนที่ไม่ได้พัก\n \n3. คลิกปุ่ม **สร้างการแข่งขัน**\n \n4. ระบบจะเสนอการแข่งขันตามกลยุทธ์ที่เลือก (เช่น แข่งขัน ผสม)\n \n5. คุณสามารถยอมรับการแข่งขันที่แนะนำหรือเลือกด้วยตนเองจากรายการที่เป็นไปได้\n \n6. ตัวบ่งชี้คุณภาพแสดงว่าการแข่งขันคาดว่าจะสมดุลเพียงใด

source: Toggle **Offline Mode** on the start screen if you don't have a stable internet connection or want to test without saving data to the server.\n \n• Results are stored locally on your device.\n \n• You can sync them later when you're back online.
th: เปิด **โหมดออฟไลน์** ในหน้าจอเริ่มต้นหากคุณไม่มีการเชื่อมต่ออินเทอร์เน็ตที่เสถียร หรือต้องการทดสอบโดยไม่บันทึกข้อมูลไปยังเซิร์ฟเวอร์\n \n• ผลลัพธ์จะถูกเก็บไว้ในเครื่องของคุณ\n \n• คุณสามารถซิงค์ภายหลังเมื่อคุณกลับมาออนไลน์

source: Use the **Check-in** screen to manage player attendance. Tap a player to toggle their status.\n \n• **Green**: Player is here and ready to play.\n \n• **Gray**: Player is checked out (not available for matches).\n \n• Useful for players arriving late or leaving early.
th: ใช้หน้าจอ **เช็คอิน** เพื่อจัดการการเข้าร่วมของผู้เล่น แตะผู้เล่นเพื่อสลับสถานะ\n \n• **สีเขียว**: ผู้เล่นอยู่ที่นี่และพร้อมเล่น\n \n• **สีเทา**: ผู้เล่นเช็คเอาท์แล้ว (ไม่พร้อมสำหรับการแข่งขัน)\n \n• มีประโยชน์สำหรับผู้เล่นที่มาสายหรือกลับเร็ว

source: You can set the number of available courts in the settings. The system tracks play counts and suggests breaks for players who have played the most.\n \n• Players due for a break are highlighted in yellow in the Queue.\n \n• This helps ensure equal playing time for everyone.
th: คุณสามารถตั้งจำนวนสนามที่พร้อมใช้งานในการตั้งค่า ระบบติดตามจำนวนครั้งที่เล่น และแนะนำให้ผู้เล่นที่เล่นมากที่สุดพัก\n \n• ผู้เล่นที่ควรพักจะถูกไฮไลต์สีเหลืองในคิว\n \n• สิ่งนี้ช่วยให้แน่ใจว่าทุกคนได้เล่นเท่าๆ กัน

source: Icons Guide
th: คู่มือไอคอน

source: Here is a guide to the icons used in the Event Manager:
th: นี่คือคู่มือสำหรับไอคอนที่ใช้ในตัวจัดการกิจกรรม:

source: Toggle player attendance. Green means checked in.
th: สลับการเข้าร่วมของผู้เล่น สีเขียวหมายถึงเช็คอินแล้ว

source: Generate / Rebalance
th: สร้าง / ปรับสมดุลใหม่

source: Generate new draws or rebalance the current round.
th: สร้างการจับคู่ใหม่หรือปรับสมดุลรอบปัจจุบัน

source: Reset
th: รีเซ็ต

source: Reset a round to the original draw if you changed something.
th: รีเซ็ตรอบกลับไปเป็นการจับคู่เดิมหากคุณเปลี่ยนแปลงบางอย่าง

source: Manage Teams
th: จัดการทีม

source: Create fixed teams or anti-teams (players who shouldn't play together).
th: สร้างทีมถาวรหรือทีมตรงข้าม (ผู้เล่นที่ไม่ควรเล่นด้วยกัน)

source: Edit player details like name, gender, or payment status.
th: แก้ไขรายละเอียดผู้เล่น เช่น ชื่อ เพศ หรือสถานะการชำระเงิน

source: Adjust Seeds
th: ปรับอันดับ

source: Manually adjust player ratings for the event.
th: ปรับคะแนนผู้เล่นสำหรับกิจกรรมด้วยตนเอง

source: The Draw Generator allows you to create matches based on different strategies:
th: ตัวสร้างการจับคู่ช่วยให้คุณสร้างการแข่งขันตามกลยุทธ์ต่างๆ:

source: : Players are divided into similar skill levels. Teams are balanced to create close matches.
th: : ผู้เล่นจะถูกแบ่งออกเป็นระดับทักษะที่ใกล้เคียงกัน ทีมจะมีความสมดุลเพื่อสร้างการแข่งขันที่สูสี

source: : Teams are balanced by skill, but players are not strictly separated by level.
th: : ทีมมีความสมดุลตามทักษะ แต่ผู้เล่นไม่ได้ถูกแยกตามระดับอย่างเคร่งครัด

source: : Classic round-robin format where everyone plays with everyone.
th: : รูปแบบพบกันหมดแบบคลาสสิกที่ทุกคนเล่นกับทุกคน

source: In Competitive or Mixed mode, the system will regenerate future matches when you select the winner of the matches in the current or past rounds. This is recommended in order to optimize future rounds based on the new data. In Round-Robin mode, the future rounds will not change unless you manually change them.
th: ในโหมดแข่งขันหรือผสม ระบบจะสร้างการแข่งขันในอนาคตใหม่เมื่อคุณเลือกผู้ชนะของการแข่งขันในรอบปัจจุบันหรือรอบที่ผ่านมา แนะนำให้ทำเช่นนี้เพื่อปรับปรุงรอบในอนาคตให้เหมาะสมตามข้อมูลใหม่ ในโหมดพบกันหมด รอบในอนาคตจะไม่เปลี่ยนแปลงเว้นแต่คุณจะเปลี่ยนด้วยตนเอง

source: You can also adjust the number of courts. The system requires 4 players per court.
th: คุณยังสามารถปรับจำนวนสนามได้ ระบบต้องการผู้เล่น 4 คนต่อสนาม

source: Round Management
th: การจัดการรอบ

source: Each round has several management options:
th: แต่ละรอบมีตัวเลือกการจัดการหลายอย่าง:

source: Rebalance
th: ปรับสมดุลใหม่

source: Regenerates the current round with the same players but moves players around to balance the skill level of each court. This will aggressively optimize each court to have the highest chance of having a tie, but may not divide the court by level groups. Useful if you replace a player and need the matches to be balanced again.
th: สร้างรอบปัจจุบันใหม่ด้วยผู้เล่นคนเดิม แต่ย้ายผู้เล่นไปรอบๆ เพื่อปรับสมดุลระดับทักษะของแต่ละสนาม สิ่งนี้จะปรับให้แต่ละสนามมีโอกาสเสมอสูงสุด แต่ไม่อาจแบ่งสนามตามกลุ่มระดับ มีประโยชน์หากคุณเปลี่ยนผู้เล่นและต้องการให้การแข่งขันสมดุลอีกครั้ง

source: Reset (Mixed)
th: รีเซ็ต (ผสม)

source: Resets the round and attempts to create mixed-gender pairs.
th: รีเซ็ตรอบและพยายามสร้างคู่ผสมชายหญิง

source: Reset (All)
th: รีเซ็ต (ทั้งหมด)

source: Resets the round to the original matches.
th: รีเซ็ตรอบกลับไปเป็นการแข่งขันเดิม

source: Player Management
th: การจัดการผู้เล่น

source: Manage players directly from the Check-in list:
th: จัดการผู้เล่นโดยตรงจากรายการเช็คอิน:

source: Click a player's name to toggle check-in status.
th: คลิกชื่อผู้เล่นเพื่อสลับสถานะเช็คอิน

source: Use the
th: ใช้

source: icon to edit player details (Name, Gender, Paid status).
th: ไอคอนเพื่อแก้ไขรายละเอียดผู้เล่น (ชื่อ เพศ สถานะการชำระเงิน)

source: Use
th: ใช้

source: to create Teams (always play together) or Anti-Teams (never play together on the same court).
th: เพื่อสร้างทีม (เล่นด้วยกันเสมอ) หรือทีมตรงข้าม (ไม่เล่นด้วยกันในสนามเดียวกัน)

source: to adjust player ratings (seeds) for the event. This affects matchmaking but not their permanent rating.
th: เพื่อปรับคะแนนผู้เล่น (อันดับ) สำหรับกิจกรรม สิ่งนี้ส่งผลต่อการจับคู่แต่ไม่ส่งผลต่อคะแนนถาวรของพวกเขา

source: Entering Results & Syncing
th: การป้อนผลลัพธ์และการซิงค์

source: Enter scores directly on the match cards. Tap to select a winner, or press and hold to input the score as well.
th: ป้อนคะแนนโดยตรงบนการ์ดการแข่งขัน แตะเพื่อเลือกผู้ชนะ หรือกดค้างไว้เพื่อป้อนคะแนนด้วย

source: Once matches are complete, use the
th: เมื่อการแข่งขันเสร็จสิ้น ให้ใช้

source: button at the bottom of the page to submit all results to the server.
th: ปุ่มที่ด้านล่างของหน้าเพื่อส่งผลลัพธ์ทั้งหมดไปยังเซิร์ฟเวอร์

source: Scores are not saved permanently until you Sync.
th: คะแนนจะไม่ถูกบันทึกอย่างถาวรจนกว่าคุณจะซิงค์

source: The Event Manager works offline! All data is saved locally to your device.
th: ตัวจัดการกิจกรรมทำงานแบบออฟไลน์! ข้อมูลทั้งหมดจะถูกบันทึกไว้ในอุปกรณ์ของคุณ

source: You can run an entire event without internet. Just make sure to Sync Scores when you have a connection again to save the results.
th: คุณสามารถจัดกิจกรรมทั้งหมดได้โดยไม่ต้องใช้อินเทอร์เน็ต เพียงตรวจสอบให้แน่ใจว่าได้ซิงค์คะแนนเมื่อคุณมีการเชื่อมต่ออีกครั้งเพื่อบันทึกผลลัพธ์

source: Note: If you clear your browser data, local event data will be lost.
th: หมายเหตุ: หากคุณล้างข้อมูลเบราว์เซอร์ ข้อมูลกิจกรรมในเครื่องจะสูญหาย

source: Event Manager Guide
th: คู่มือตัวจัดการกิจกรรม

source: Complete guide to running events with the Event Manager.
th: คู่มือฉบับสมบูรณ์สำหรับการจัดกิจกรรมด้วยตัวจัดการกิจกรรม

source: Future rounds have scores entered. Regenerating will delete these scores. Are you sure?
th: รอบในอนาคตมีคะแนนที่ป้อนแล้ว การสร้างใหม่จะลบคะแนนเหล่านี้ คุณแน่ใจหรือไม่?

source: Regenerate Rounds?
th: สร้างรอบใหม่?

source: Add {0}Guest{1}
th: เพิ่ม{0}แขก{1}

source: Add Guest Players
th: เพิ่มผู้เล่นแขก

source: Alex Johnson
th: อเล็กซ์ จอห์นสัน

source: Close
th: ปิด

source: Enter each guest player's name on a new line
th: ใส่ชื่อผู้เล่นแขกแต่ละคนในแต่ละบรรทัด

source: Guest Names (one per line)
th: ชื่อแขก (หนึ่งชื่อต่อบรรทัด)

source: Jane Doe
th: เจน โด

source: John Smith
th: จอห์น สมิธ

source: Preview ({0} guest{1})
th: ดูตัวอย่าง ({0}แขก{1})

source: Add guest players
th: เพิ่มผู้เล่นแขก

source: Delete Guest
th: ลบแขก

source: Delete this match?
th: ลบการแข่งขันนี้หรือไม่?

source: Help
th: ช่วยเหลือ

source: Rebalance match
th: ปรับสมดุลการแข่งขัน

source: The match will be removed from this round. You can restore the originally scheduled matches using the round reset icon.
th: การแข่งขันนี้จะถูกลบออกจากรอบนี้ คุณสามารถกู้คืนการแข่งขันที่กำหนดไว้เดิมได้โดยใช้ไอคอนรีเซ็ตรอบ

source: Blue dot indicates the team that has service in the match.
th: จุดสีน้ำเงินแสดงทีมที่มีสิทธิ์เสิร์ฟในการแข่งขัน

source: Generate new draws or rebalance the round or match.
th: สร้างการจับสลากใหม่หรือปรับสมดุลรอบหรือการแข่งขัน

source: Service Indicator
th: ตัวบอกสิทธิ์เสิร์ฟ

source: Not paid
th: ยังไม่ได้ชำระ

source: Paid
th: ชำระแล้ว

source: load more
ja: もっと読み込む

source: load previous
ja: 前のものを読み込む

source: event:
ja: イベント:

source: end date
ja: 終了日

source: start date
ja: 開始日

source: login
ja: ログイン

source: Any details from the location will already be included. Mention any additional event-specific instructions, rules, or details.
ja: ロケ地からの詳細はすでに含まれています。その他のイベント特有の指示、規則、詳細」があれば記載してください。

source: date and time
ja: 日時

source: location (google maps link)
ja: 場所（googleマップリンク）

source: instructions or information that will apply to all events held at this location.
ja: この場所で開催されるすべてのイベントに適用される指示または情報。

source: Add New Location
ja: 新しい場所を追加

source: {0} event Details
ja: {0} イベント詳細

source: All Level Badminton
ja: すべてのレベルのバドミントン

source: {waitlistCount, plural, one {spot available} other {spots available}}
ja: {waitlistCount, plural, one {枠空席あり} other {枠空席あり}}

source: Football
ja: サッカー

source: Squash
ja: スカッシュ

source: Tennis
ja: テニス

source: American Football
ja: アメリカンフットボール

source: join waitlist
ja: ウェイトリストに参加

source: Location doesn't exist.
ja: 場所が存在しません。

source: loading events...
ja: イベントを読み込んでいます...

source: ...load past ratings
ja: ...過去の評価を読み込む

source: Currently the league is in testing mode. To participate, please join the Pickleball events here:
ja: 現在、リーグはテストモードです。参加するには、こちらのピクルボールイベントに参加してください:

source: Next Prize: June 10
ja: 次の賞品: 6月10日

source: Recreational Doubles Rankings
ja: レクリエーショナルダブルスランキング

source: Loser Points
ja: 敗者ポイント

source: Select Losers
ja: 敗者を選択

source: Select Winners
ja: 勝者を選択

source: Winner Points
ja: 勝者ポイント

source: To participate, please join the badminton events here:
ja: 参加するには、こちらのバドミントンイベントに参加してください:

source: bulk events
ja: すべてのイベント

source: type your events here
ja: ここにイベントを入力してください

source: yubibado
ja: ゆびバド

source: court {0}
ja: コート {0}

source: select all
ja: すべて選択

source: all
ja: すべて

source: badminton
ja: バドミントン

source: pickleball
ja: ピクルボール

source: delete
ja: 削除

source: points
ja: 何点

source: queued matches
ja: キューされた試合

source: Completed
ja: 試合終了

source: Matchmaking
ja: マッチメイキング

source: Players
ja: プレイヤー

source: Quality
ja: 競争力で

source: Competitive Plus
ja: 競争力プラス

source: Matches are arranged by a maximum skill-spread of +- 2 players.
ja: マッチは、最大スキルスプレッドが+-2プレイヤーになるように配置されます。

source: Tournament Mode
ja: トーナメントモード

source: Queued Matches
ja: キューされた試合

source: Current Matches
ja: 現在の試合

source: Easy Mode
ja: イージーモード

source: Players on Break
ja: 休憩中のプレイヤー

source: Toggle All
ja: すべてを切り替える

source: Checkin
ja: チェックイン

source: Finished
ja: 終了

source: Optimized for DUPR. Teams created with similar skill level players.
ja: DUPRに最適化されました。同じスキルレベルのプレイヤーでチームを作成します。

source: Deselect All
ja: すべて選択解除

source: Select All
ja: すべて選択

source: Round Robin
ja: 総当たり戦

source: Unique combination of matches.
ja: マッチのユニークな組み合わせ。

source: Doe John
ja: ジョン・ドウ

source: It looks like you may prefer English. Would you like to switch to English?
ja: 日本語がお好きなようですね。日本語に変更しますか？

source: Switch to English
ja: 日本語に切り替える

source: Google Calendar
ja: Google カレンダー

source: required rating: {0}
ja: 必要な評価: {0}

source: your rating {0} is too low. please join a JPL open event to boost your rating. the fastest way is to play and beat Jai a couple of times
ja: あなたの評価{0}が低すぎます。評価を上げるためにJPLオープンイベントに参加してください。最速の方法は、Jaiと何度かプレイして勝つことです

source: Enable All
ja: すべてを有効にする

source: Privacy Policy
ja: プライバシーポリシー

source: Share Feedback
ja: フィードバックを共有

source: Required rating: {0}
ja: 必要な評価: {0}

source: Your rating {0} is too low. You will be placed in the waitlist until the rating limit is lowered. Please join a JPL open event to boost your rating.
ja: あなたのレーティング{0}は低すぎます。レーティングの上限が下がるまでウェイティングリストに登録されます。レーティングを上げるためにJPLのオープンイベントに参加してください。

source: restricted by level
ja: レベルによって制限

source: Your rating {0} is too low. You will be placed in the pending list until the rating limit is lowered. Please join another JPL rated event to boost your rating.
ja: あなたのレーティング{0}は低すぎます。レーティングの上限が下がるまで保留リストに登録されます。レーティングを上げるために別のJPL評価イベントに参加してください。

source: pkuru
ja: ピックル
